Tekla Open API Reference for Tekla Structures 2025
Weld.Position Property
 Defines the position. Use of Direction is preferred over this.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Weld.WeldPositionEnum Position { get; set; }
Public Property Position As Weld.WeldPositionEnum
	Get
	Set
Property Value
Type: Weld.WeldPositionEnum
See Also
Reference
Weld Class
Tekla.Structures.Model Namespace